record = {
    "1388807464596341962": 0,
    "11686835270657773399": 1,
    "17742894046869862114": 2,
    "13315301355602027825": 3,
    "4004308219571680113": 4,
    "1438134505462242192": 5,
    "7062578419350324245": 6,
    "16558917729305874029": 7,
    "2407402883759763646": 8,
    "12663528655678229537": 9,
    "1168440978755831426": 10,
    "9142045337100104095": 11,
    "16708055074147356504": 12,
    "11688901659336124162": 13,
    "2567163264753946024": 14,
    "15562051808872901398": 15,
    "12235079986515827170": 16,
    "4230642811140312531": 17,
    "10249401992574644714": 18,
    "4634412375863893641": 19,
    "117029381625775928": 20,
}


credits = [
    500,500,500,800,800,1000,1000,1200,1500,2000,500,500,500,800,1000,1000,1500,1800,1800,2000,8888888
]

# titles = [
#     "第二道题（上）",
#     "格线之间",
#     "深入龙穴",
#     "出题事故",
#     "双盲实验",
#     "命名有道",
#     "大调钢琴",
#     "作文考试",
#     "奇怪的问卷",
#     "Meta: 龙说",
#     "第二道题（下）",
#     "国画",
#     "仓颉造字",
#     "迷宫? 谜宫！",
#     "八法恒久远",
#     "笨龙笨事",
#     "//只有.三个.词语",
#     "龙的笔记本",
#     "星与六十",
#     "Meta: 龙绘",
#     "Final Meta: 让我们的色彩为世间增添欢笑",
# ]

answers = [
    ["ORANGE LETTUCE", "LETTUCE ORANGE", "ORANGE", "LETTUCE", "E", "C6", "6C", "U IS THE FIFTH", "THE FOURTH LETTER IS T", "THE THIRD LETTER IS T", "IS E", "L"],
    ["blue salad"],
    ["tomato theory"],
    ["grey wolves" ,"a grey wolf", "plural ver"],
    ["sunset spring", "find stingers"],
    ["coffee berries"],
    ["environmental-friendly bikes"],
    ["white ganesh","Gkessgjkrbpmqgsyryhhvhiw", "Fibonaccireadsdiagonally"],
    ["lavender lights"],
    ["breakdown"],
    ["误惊征袖湿啼痕", "忆山摇膝石上晚", "报答春光知有处", "荷叶罗裙一色裁", "晴彩辉煌映画栏", "龙斗雌雄势已分", "月黑雁飞高", "归人望烟火"],
    ["楚峡云归无觅处"],
    ["屏妆水墨夸陶弼"],
    ["四川昝帅尚粗豪"],
    ["巷议街谈一粲然","发吉利话到站内信"],
    ["疏蓼黄芦宜掩映"],
    ["珑板腰肢捉板歌", "珑", "板","腰","肢","捉", "歌"],
    ["恨难得兮仰天悲", "恨","难","得","兮","仰","天","悲"],
    ["碑折松枯山火烧", "熊孺登", "xiongrudeng", "vindemiatrix", "经古墓"],
    ["草荒柏穼"],
    ["#ffff00#00ffff#00ff00#ff00ff#ff0000#0000ff#3bc041#f379ab#e1cb2f#87fdf1#34a0a2#fa6939O::U::R:::H::U::G:E::A::N:::N::I::V:E::R::S:::A::R::Y"]
]

purchaseable_titles = [
    # "椒图轩",
    # "螭首居",
    "蒲牢亭",
    "蚩吻台",
    "鳌鱼楼",
    "负屃阁",
    "囚牛斋",
    "螭虎堂",
    "金吾宫",
    # "蛟龙殿",
    # "狴犴轩",
    # "赑屃居",
    "蟋蜴亭",
    "嘲风台",
    "狻猊楼",
    "貔貅阁",
    "饕餮斋",
    "睚眦堂",
    "龙马宫",
    # "应龙殿",
    # "万龙之巅",
]


titles = [
    "椒图轩",
    "螭首居",
    "蒲牢亭",
    "蚩吻台",
    "鳌鱼楼",
    "负屃阁",
    "囚牛斋",
    "螭虎堂",
    "金吾宫",
    "蛟龙殿",
    "狴犴轩",
    "赑屃居",
    "蟋蜴亭",
    "嘲风台",
    "狻猊楼",
    "貔貅阁",
    "饕餮斋",
    "睚眦堂",
    "龙马宫",
    "应龙殿",
    "万龙之巅",
]

titles_to_num = {
    
}

i = 0
for title in titles:
    titles_to_num[title] = i
    i += 1
    

unlock_token = ['5ace_5671_8799_47b7_ce9e_fe662b1f', '4891_c0b5_beb2_3697_b959_1480a23c', '7511_910b_87b1_f284_1c2b_1e005879', '8cb2_efe8_7983_8253_3275_1315cc21', 'f96f_38b0_cec1_1941_45ed_db4008c6', '3b2c_7fed_eead_05a0_549a_d3560ade', 'acc6_c4c2_f285_943b_1864_30ff9195', '6e8d_11cd_d618_7757_9239_f8fd1410', '04eb_e582_d3d8_8565_9c94_00000000', '33ce_f38d_4b05_2803_adda_00000000', '9398_2f87_f199_ce70_2006_2482caa5', '6a23_bf14_0510_f496_b7f5_ceca85bd', 'b645_ede3_d80b_fe09_d989_266febde', '42af_a7b5_23a8_6c9c_e91b_f5ddaf52', '66c1_d34b_9d86_7361_e46e_1942a7e4', '05c3_9123_e839_d489_8ede_f89fb128', 'ff6d_089b_968a_4879_da7c_30574808', 'cb01_5d31_9ec4_6f25_7c17_5cfb34ca', 'a00b_d875_9662_30ee_35f4_00000000', '5656_a54b_fc87_c8c1_e4a3_00000000', '90a79407ebf022a3092f1c27f3b56d79']

